#include"settings.h"
using namespace std;
void c1(int x)
{
	switch (x)
	{
	case 1:
		goto c1_1;
	case 2:
		goto c1_2;
	}
c1_1:
	cout << "北原的天气很冷，用滴水成冰来说丝毫不为过。\n";
	Sleep(2000);
	cout << "不过，今天可不冷了。\n";
	Sleep(2000);
	cout << "“你这块地瓜！你有什么实力！直接给我停下！”意晚喝道。\n";
	Sleep(2000);
	cout << "“你要长生找其它灵药啊！欺负我这个地瓜算什么正道！”被追的地瓜喊道。\n";
	Sleep(2000);
	cout << "“哼，既然捉不到，那就杀了吧！我新炼制的傀儡还没试试呢……”\n";
	Sleep(2000);
	cout << "伴着鬼气的震荡，一个高大的身影出现了，地瓜一惊，摔倒在地。\n";
	Sleep(2000);
	cout << "“杀了她！”意晚喊道。\n";
	Sleep(2000);
	cout << "地瓜绝望的闭上了眼……\n";
	Sleep(4000);
	cout << "咔！\n";
	Sleep(2000);
	cout << "“在妖族领地的边界线上还敢杀戮妖族，你真敢啊。”黎雾支起文气屏障，淡淡道。\n";
	Sleep(2000);
	cout << "“神经病！”意晚看了看黎雾的实力，一溜烟跑了。\n";
	Sleep(2000);
	cout << "“安全了，你先去瓜家庄吧，顺着这条路走就可以了。”黎雾对忆源道。\n";
	Sleep(2000);
	cout << "“不知您的姓名？”忆源问道。\n";
	Sleep(2000);
	cout << "“叫我‘黎雾’就可以。”黎雾说着离开了。\n";
	Sleep(2000);
	cout << "送走了忆源，黎雾呼了一口气。\n";
	Sleep(2000);
	cout << "最近边境失踪的妖族越来越多，导致原本用来磨资历的巡边校尉也成了一个繁忙的事务，早知道就应该去海务司的。" << sleep(2);
	cout << "而且还有妖皇的限期破案令，三个休沐(15日)内完不成可就要撤职了，想想就令黎雾头疼。" << sleep(3);
	cout << "不过突然一道细微的声音传到了黎雾耳中。" << sleep(3);
	cout << "黎雾扭头看去，发现是一只埋伏在山林中的黑熊，一看就与目击者所描述的失踪案作案嫌疑人几乎一致！" << sleep(3);
	cout << "察觉到自己被发现了，熊妖直接扑了过来！" << sleep(3);
	cout << "——————已自动存档";
	saving(2);
c1_2:
	switch (w1())
	{
	case 0:
		c2_1();
	case 1:
		saving(3);
		c2_2();
	}
}
void c2_1()
{
	cout << "九章哼着歌，把黎雾塞进了麻袋里。" << sleep(2);
	cout << "他盘算着黎雾能卖的价钱，心里确早已畅想接下来一个月去哪里玩了。" << sleep(2);
	cout << "是去花果山玩玩呢？还是去无情冰崖攀岩呢？" << sleep(2);
	cout << "“岗，要动手吗？”昇潭问鹤岗道。" << sleep(2);
	cout << "“当然，到时候你先这样……在这样……我就……”鹤岗胸有成竹地分析道。" << sleep(2);
	cout << "“但……人要走了啊……”昇潭注视着渐渐走远的九章道。" << sleep(2);
	cout << "“快！！快动手！”" << sleep(2);
	cout << "可怜的九章，还畅想着花果山上朝暮祠的宏大，却没有意料到一个五味包直接砸了上来。" << sleep(3);
	cout << "*五味包：用辣椒粉、石灰粉等五种粉末混成的包裹，撒在人眼上可造成恐怖的伤害，是下三流格斗必备物品。" << sleep(4);
	cout << "他也心知遇到了剪径的强人，心中暗道一声“不好”，丢下麻袋捂着发痛的双眼转身往树林窜去。" << sleep(3);
	cout << "“先别追他了吧，看看那熊丢下了什么先。”鹤岗拉住了准备追击的昇潭。" << sleep(2);
	cout << "昇潭点点头，解开包裹就直接往地上抖。却是把昏迷中的黎雾抖了出来。" << sleep(2);
	cout << "“我们……好像抢了一个妖贩子？”昇潭疑惑道。" << sleep(2);
	cout << "“先别管啥了，先给这只猫妖把封感符撕掉，唤醒她吧。毕竟人妖签订的《人妖互不侵犯条约》还没变成废纸。”" << sleep(4);
	cout << "“也好。”" << sleep(2);
	c2(1);
}
void c2_2()
{
	cout << "看着一溜烟逃了的九章，黎雾捂着胸口找了棵树倚坐下来。" << sleep(2);
	cout << "“咳咳……为什么妖族会有妖贩子……明明都受到人类的欺压，又为何搞起内斗？”" << sleep(2);
	cout << "想起早晨那追杀忆源的修仙者，黎雾心中也只得长叹了一声“呜呼哀哉”。" << sleep(2);
	cout << "却远远望见有几个人形生物正暗戳戳朝此处赶来。" << sleep(2);
	cout << "黎雾默默地从怀中摸出太平匕——如果他们是不怀好意的话，她就让那些趁人之危的家伙常常太平匕自爆的滋味。" << sleep(4);
	cout << "“岗！快看！这里有只伤重的猫妖，要不要去抢劫一番？”一个人类发现了她。" << sleep(3);
	cout << "是人类？黎雾想着，却是做好了自杀的准备。毕竟人类对她们剥皮抽骨烧烤食用的事情可是不少……" << sleep(3);
	cout << "“别了，留点丹药就走吧，也省去被报复的可能。”" << sleep(3);
	cout << "那人点点头，取出一瓶丹药放下后就转身离开了。" << sleep(2);
	cout << "黎雾疑惑地放下匕首，望向离去的二人，人妖横贯百年的仇怨怎么消失了呢？" << sleep(2);
}
void c2(int x)
{
	switch (x)
	{
	case 1:
		goto c2__1;
	case 2:
		goto c2__2;
	}
c2__1:
	saving(4);
	cout << "忆源离开黎雾后便顺着最好的一条路走，不久便来到了瓜家庄。" << sleep(2);
	cout << "考虑了自己的资本，忆源开始了烤地瓜的大业。" << sleep(2);
	cout << "虽然她的烤地瓜没有别家的那般脆爽，但借助香甜软糯的口感，倒也可以依靠瓜家庄的流动人口谋生。" << sleep(2);
	cout << "不过最近经济似乎算不得好了，瓜家庄的客流量也在急速下降，好像是人类的收税官提高了关税导致的。" << sleep(2);
	cout << "虽然这一切与将要搬往妖州第一城市——朝暮城的忆源无关了" << sleep(2);
	cout << "忆源看向了手中的地图，该走那一条路呢？" << sleep(2);
	cout << "1.向东横穿白河盆地，直至朝暮城。(注：易受寒流侵袭)" << sleep(2);
	cout << "2.向北乘船到朝暮城。(注：海上大风红色预警)" << sleep(2);
	cin >> cur;
	switch (cur)
	{
	case 1:
		cout << "忆源决定沿相对平缓的白河盆地而行。" << sleep(2);
		cout << "这一带是妖州为数不多的妖口聚集区，也是妖族的发源地。" << sleep(2);
		cout << "忆源驾驶着械力车，一路游山玩水，游览妖族遗迹：有雄伟宏大的妖祖(朝暮)起兵纪念碑、煞气腾腾的蒟蒻古战场遗址、还有垒的极高的鲤头坛……" << sleep(4);
		cout << "终于到了朝暮城郊，眼前的场景却让忆源吃了一惊。" << sleep(2);
		cout << "一眼望去尽是密密麻麻的妖民，在这里驾车和步行的速度都被妖群压到了一个可怜的水平。" << sleep(2);
		cout << "忆源看着这么多妖，还不是嗅到了商机，立刻就在这里卖起了烤地瓜来……" << sleep(5);
		cout << "那么……为什么这里有着么多妖呢？" << sleep(3);
		break;
	case 2:
		cout << "忆源很庆幸自己没有晕船的毛病。" << sleep(3);
		cout << "刚出发不久，第二号寒流“晟碑”就来了。" << sleep(2);
		cout << "那时疯狂的暴风雪几乎要把卡在冰中的船拦腰斩断，忆源唯一能做的只有缩在客舱内祈祷着寒流赶紧离去……" << sleep(3);
		cout << "不知这一惊心的旅途持续了多久，至少到朝春港时便已经进入了短暂的春天了。" << sleep(2);
		cout << "急需吃饭的忆源很快便锁定了要去的地方——天坛！" << sleep(2);
	}
	cout << "……" << sleep(5);
	cout << "九章一瘸一拐地回到了老巢。" << sleep(2);
	cout << "手下立刻围了过来，个个面带焦虑与沮丧。" << sleep(2);
	cout << "“大哥，今天都没抢到什么口粮，我们这个冬天可能要挨饿了……”" << sleep(2);
	cout << "九章看了看手下们，无奈地坐到了石块上。" << sleep(2);
	cout << "“早知道我们就不应该抢劫的那般频繁，”三当家愤恨道，“现在的商旅都不走这条路了，都走小路去了！”" << sleep(3);
	cout << "“现在后悔也没用了，都想想有什么法子吧。”九章压下了众人有些激动的情绪说道" << sleep(2);
	cout << "“我们不如就此散伙吧，也免得大伙饿死。”二当家道。" << sleep(2);
	cout << "“但散伙后又去哪里？被乡间民众挨个找到，被柴刀和斧子劈死吗？”一个山贼道。" << sleep(2);
	cout << "“我……我能说两句吗？”一个瘦弱的山贼举手道。" << sleep(2);
	cout << "九章看了过去：“说吧，你叫什么？”" << sleep(2);
	cout << "“我叫苍魂，我觉得……可以给赫仑县老爷写封信，告诉他说我们想被招安……”" << sleep(2);
	cout << "山寨里立刻炸锅了。" << sleep(2);
	cout << "“你这是在害我们！官府怎么会招安我们，它们恨不得把我们统统剁碎才对！”二当家怒道。" << sleep(2);
	cout << "“都闭死嘴！”九章砰的一声拍在桌子上，“听他讲完再说！”" << sleep(2);
	cout << "苍魂咽了几口唾沫，继续讲到：" << sleep(2);
	cout << "“现任县尉‘琼瑶’马上就要调走了，她肯定希望走之前多捞几笔政绩，山贼盗匪被招安不也是政绩吗？”" << sleep(2);
	cout << "“但她不会将我们统统坑杀吗？”三当家忧虑道。" << sleep(2);
	cout << "“这样吧，先别讨论这些后续了，反正我们也没什么出路了……”九章敲了敲桌子，“你去说服琼瑶招安我们吧。”" << sleep(5);
	cout << "就这样，苍魂带着珠宝踏上了去赫仑县的路……" << sleep(3);
	saving(5);
c2__2:
	cout << "苍魂见到了琼瑶。" << sleep(3);

}